function start() {
    status = -1;
    action(1, 0, 0);
}
var x;
var x2;

function action(mode, type, selection) {
    if (status == 0 && mode == 0) {
        cm.dispose();
        return;
    }
    if (mode == 1) {
        status++;
    } else {
        status--;
    }
	
	var cid = cm.getPlayer().查看目标();
	var exp = cm.getPlayer().获取锻造信息("forgingExp",cid);
    if (status == 0) {
		var 文本 = "  #i4030000#  #i4030001#  #i4030010# #r#e< 锻造工艺 >#k#n #i4030011#  #i4030014#  #i4030015#\r\n\r\n";
		文本 +=" #b说明#k:锻造等级越高，制作成本越低，有概率制作成诅咒卷，或者额外获取。\r\n\r\n";
		文本 +=" #b锻造师#k : "+cm.取角色名字(cid)+"("+cid+")\r\n";
		//文本 +=" #b锻造等级#k : Lv.1\r\n";
		文本 +=" #b熟练度#k : "+exp+"\r\n";
		文本 +="\r\n\r\n";
			for (var ii = 0; ii < 数据.length; ii++) {
				文本 += "#L"+ii+"# #v"+数据[ii][1]+"# #b#t"+数据[ii][1]+"##k exp + "+数据[ii][4]+"\r\n";
			}
			
			文本 +="\r\n";
			cm.sendSimple(文本);
    } else if (status == 1) {
		x = selection;
		cm.sendGetText("\r\n输入你要合成的数量；");
    } else if (status == 2) {
		x2=cm.getText();
		if(x2==""){
			cm.sendOk("请不要加入空格。");
			cm.dispose();
			return;
		}
		
		if(x2.indexOf(" ")!=-1){
			cm.sendOk("请不要加入空格。");
			cm.dispose();
			return;
		}
		
		if(isNaN(x2)){
			cm.sendOk("请输入正确的数字。");
			cm.dispose();
			return;
		}
		
		if(x2 < 0){
			cm.sendOk("请输入正确的数字。");
			cm.dispose();
			return;
		}
		
		if(x2 > 100){
			cm.sendOk("一次最多制作100个。");
			cm.dispose();
			return;
		}
		cm.sendYesNo("制作 #v"+数据[x][1]+"# #b#t"+数据[x][1]+"##k x "+x2+" \r\n需要以下材料；\r\n\r\n #v"+数据[x][0]+"# #b#t"+数据[x][0]+"##k x "+数据[x][2]*x2+" / "+cm.getItemQuantity(数据[x][0])+"\r\n #v4031039# #b金币#k x "+数据[x][3]*x2+" / "+cm.判断金币());
	} else if (status == 3) {
		if (!cm.haveItem(数据[x][0],数据[x][2]*x2)) {
			cm.sendOk("需要 #v"+数据[x]+"# #b#t"+数据[x]+"##k x "+数据[x][2]*x2+" 才可以制作。");
			cm.dispose();
			return;
		}
		if (cm.getMeso() < 数据[x][3]*x2){
			cm.sendOk("你没有 #v4031039# 金币 x "+数据[x][3]*x2+"");
			cm.dispose();
			return;
		}
		if (cm.getInventory(2).isFull()) {
			cm.sendOk("请保证 #b消耗栏#k 至少有2个位置。");
			cm.dispose();
			return;
		} 
		
		cm.gainMeso(-数据[x][3]*x2);
		cm.gainItem(数据[x][0],-数据[x][2]*x2);
		cm.gainItem(数据[x][1],x2);
		cm.getPlayer().修改锻造信息("forgingExp",数据[x][4]*x2,cid);
        cm.sendOk("恭喜你成功制作 #v"+数据[x][1]+"# #b#t"+数据[x][1]+"##k x "+x2+"");
    }
}


var 数据 = [
	//头盔防御卷轴
	[2040001,2040002,5,10000,5],
	//头盔体力卷轴
	[2040004,2040005,5,10000,5],
	//耳环智力卷轴
	[2040301,2040302,5,10000,5],
	//上衣防御卷轴
	[2040401,2040402,5,10000,5],
	//全身铠甲敏捷卷轴
	[2040501,2040502,5,10000,5],
	//全身铠甲防御卷轴
	[2040504,2040505,5,10000,5],
	//裙防御卷轴
	[2040601,2040602,5,10000,5],
	//鞋子敏捷度卷轴
	[2040701,2040702,5,10000,5],
	//鞋子跳跃卷轴
	[2040704,2040705,5,10000,5],
	//鞋子速度卷轴
	[2040707,2040708,5,10000,5],
	//手套敏捷卷轴
	[2040801,2040802,5,10000,5],
	//手套攻击卷轴
	[2040804,2040805,5,10000,5],
	//盾牌防御卷轴
	[2040901,2040902,5,10000,5],
	//披风魔防卷轴
	[2041001,2041002,5,10000,5],
	//披风防御卷轴
	[2041004,2041005,5,10000,5],
	//披风体力卷轴
	[2041007,2041008,5,10000,5],
	//披风魔力卷轴
	[2041010,2041011,5,10000,5],
	//披风力量卷轴
	[2041013,2041014,5,10000,5],
	//披风智力卷轴
	[2041016,2041017,5,10000,5],
	//披风敏捷卷轴
	[2041019,2041020,5,10000,5],
	//披风运气卷轴
	[2041022,2041023,5,10000,5]
]













