
function start() {
    status = -1;
    action(1, 0, 0);
}



function action(mode, type, selection) {
    if (status == 0 && mode == 0) {
        cm.dispose();
        return;
    }
    if (mode == 1) {
        status++;
    } else {
        status--;
    }


    if (status == 0) {
		var 文本 = " #i4030000#  #i4030001#  #i4030010# #r#e< 冒险百科 >#k#n #i4030011#  #i4030014#  #i4030015#\r\n\r\n";
		 	
			
			文本 +="  #L1##b魔法石#k#l\r\n";
			文本 +="  #L2##b制作卷轴#k#l\r\n";

			文本 +="\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n.";
			cm.sendSimple(文本);
    } else if (status == 1) {
        switch (selection) {
			
			case 1:
				文本 ="魔法石介绍；\r\n\r\n";
				for (var ii = 0; ii < 魔法石.length; ii++) {
					文本+=""+(ii+1)+"）#v"+魔法石[ii][0]+"#  #t"+魔法石[ii][0]+"# \r\n#b"+魔法石[ii][1]+"#k\r\n\r\n";
				}
				cm.sendSimple(文本);
				cm.dispose();
                break;
			case 2:
				文本 ="制作卷轴；\r\n\r\n";
				for (var ii = 0; ii < 制作卷轴.length; ii++) {
					文本+=""+(ii+1)+"）#v"+制作卷轴[ii][0]+"#  #t"+制作卷轴[ii][0]+"# \r\n#b"+制作卷轴[ii][1]+"#k\r\n\r\n";
				}
				cm.sendSimple(文本);
				cm.dispose();
                break;
			
			default:
                cm.dispose();
                break;
        }
    }
}
























var 制作卷轴 = [
    [4131000,"记载单手剑制作方法的旧卷轴，用于锻造工艺。"],
	[4131001,"记载单手斧制作方法的旧卷轴，用于锻造工艺。"],
	[4131002,"记载单手钝器制作方法的旧卷轴，用于锻造工艺。"],
	[4131003,"记载双手剑制作方法的旧卷轴，用于锻造工艺。"],
	[4131004,"记载双手斧制作方法的旧卷轴，用于锻造工艺。"],
	[4131005,"记载双手钝器制作方法的旧卷轴，用于锻造工艺。"],
	[4131006,"记载枪制作方法的旧卷轴，用于锻造工艺。"],
	[4131007,"记载矛制作方法的旧卷轴，用于锻造工艺。"],
	[4131008,"记载短杖制作方法的旧卷轴，用于锻造工艺。"],
	[4131009,"记载长杖制作方法的旧卷轴，用于锻造工艺。"],
	[4131010,"记载弓制作方法的旧卷轴，用于锻造工艺。"],
	[4131011,"记载弩制作方法的旧卷轴，用于锻造工艺。"],
	[4131012,"记载短剑制作方法的旧卷轴，用于锻造工艺。"],
	[4131013,"记载拳套制作方法的旧卷轴，用于锻造工艺。"],
];



var 魔法石 = [
	//魔法石
    [4006000,"可在魔法密林，易德处使用，用于装备的清洗，或者一些高级技能等。"],
	//召回石
    [4006001,"用于某些高级技能。"],
	//淬炼石头
    [4006002,"可在魔法密林，易德处使用，用于装备的打孔。"],
	//抹煞石
    [4006003,"可在魔法密林，易德处使用，用于装备的附魔。"],
	//自然石
    [4006004,"可在魔法密林，易德处使用，用于装备的保护。"],
	//祝福石
    [4006005,"可在魔法密林，易德处使用，可以帮助提升装备附魔，打孔的成功率。"],
];













