function start() {
    status = -1;
    action(1, 0, 0);
}

//物品代码，获取概率，随机数量，是否展示,中奖记录，数量
var 抽奖区域 = [
	//魔法石
    [4006000,60,20,1,1,15],
	//召回石
    [4006001,60,20,1,1,15],
	//淬炼石头
    [4006002,60,20,1,1,15],
	//抹煞石
    [4006003,60,20,1,1,15],
	//自然石
    [4006004,5,20,1,1,15],
	//祝福石
    [4006005,5,20,1,1,10],
	//初级商行扩充卷
	[4007000,50,1,1,0,0],
	//中级商行扩充卷
	[4007001,10,1,1,0,0],
	//高级商行扩充卷
	[4007002,5,1,1,1,1],
	//专业商行扩充卷
	[4007003,1,1,1,1,1],
	//浪人披风(黄)
	[1102040,1,1,1,1,1],
	//浪人披风(粉)
	[1102041,1,1,1,1,1],
	//浪人披风(紫)
	[1102042,1,1,1,1,1],
	//浪人披风(褐)
	[1102043,10,1,1,1,1],
	
	//卷軸
	//头盔防御卷轴
    [2040001,60, 2, 0,0,0],
    //头盔体力卷轴
    [2040004,60, 2, 0,0,0],
    //耳环智力卷轴
    [2040301,60, 2, 0,0,0],
    //上衣防御卷轴
    [2040401,60, 2, 0,0,0],
    //全身铠甲敏捷卷轴
    [2040501,60, 2, 0,0,0],
    //全身铠甲防御卷轴
    [2040504,60, 2, 0,0,0],
    //裙防御卷轴
    [2040601,60, 2, 0,0,0],
    //鞋子敏捷度卷轴
    [2040701,60, 2, 0,0,0],
    //鞋子跳跃卷轴
    [2040704,60, 2, 0,0,0],
    //鞋子速度卷轴
    [2040707,60, 2, 0,0,0],
    //手套敏捷卷轴
    [2040801,60, 2, 0,0,0],
    //手套攻击卷轴
    [2040804,60, 2, 0,0,0],
    //盾牌防御卷轴
    [2040901, 60, 2, 0,0,0],
    //披风魔防卷轴
    [2041001, 60, 2, 0,0,0],
    //披风防御卷轴
    [2041004,60, 2, 0,0,0],
    //披风体力卷轴
    [2041007, 60, 2, 0,0,0],
    //披风魔力卷轴
    [2041010, 60, 2, 0,0,0],
    //披风力量卷轴
    [2041013, 60, 2, 0,0,0],
    //披风智力卷轴
    [2041016, 60, 2, 0,0,0],
    //披风敏捷卷轴
    [2041019, 60, 2, 0,0,0],
    //披风运气卷轴
    [2041022, 60, 2, 0,0,0],
	//单手剑制作
	[4131000,60, 2, 0,0,0],
	//单手斧制作
	[4131001,60, 2, 0,0,0],
	//单手钝器制作
	[4131002,60, 2, 0,0,0],
	//双手剑制作
	[4131003,60, 2, 0,0,0],
	//双手斧制作
	[4131004,60, 2, 0,0,0],
	//双手钝器制作
	[4131005,60, 2, 0,0,0],
	//枪制作
	[4131006,60, 2, 0,0,0],
	//矛制作
	[4131007,60, 2, 0,0,0],
	//短杖制作
	[4131008,60, 2, 0,0,0],
	//长杖制作
	[4131009,60, 2, 0,0,0],
	//弓制作
	[4131010,60, 2, 0,0,0],
	//弩制作
	[4131011,60, 2, 0,0,0],
	//短剑制作
	[4131012,60, 2, 0,0,0],
	//拳套制作
	[4131013,60, 2, 0,0,0],
	//藥水
	//普通药水
    [2000004,100,20,1,0,0],
	//超级药水
    [2000005,100,20,1,0,0]

];

function action(mode, type, selection) {
    if (status == 0 && mode == 0) {
        cm.dispose();
        return;
    }
    if (mode == 1) {
        status++;
    } else {
        status--;
    }

	var 现金券 = cm.getPlayer().获取现金券();
	
    if (status == 0) {
        var 文本 = " #i4030000#  #i4030001#  #i4030010# #r#e< 幸运抽奖 >#k#n #i4030011#  #i4030014#  #i4030015#\r\n\r\n";

        文本 += "    #L0##b抽一次(#r现金券 x 10#k)#k#l   \r\n";
        文本 += "    #L1##b十连抽(#r现金券 x 95#k)#k#l   \r\n";

        文本 += " \r\n\r\n";

        文本 += "    部分奖品展示；";
		
		for (var ii = 0; ii < 抽奖区域.length; ii++) {
			if(抽奖区域[ii][3] > 0){
				if(ii%8==0){
					文本 += "\r\n    ";
				}
				文本 += "#v"+ 抽奖区域[ii][0]+ "#";
			}
		}
		文本 += " \r\n";
		文本 += "    幸运中奖名单；";
		文本 += " \r\n";
		文本 += cm.显示中奖记录();

        文本 += "\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n.";
        cm.sendSimple(文本);
    } else if (status == 1) {
        switch (selection) {

            case 0:
				if(现金券 < 10){
					cm.sendOk("你没有足够的现金券，无法抽奖。");
                    cm.dispose();
                    return;
				}
				if (cm.getInventory(1).isFull(1)) {
                    cm.sendOk("请保证 #b装备栏#k 至少有1个位置。");
                    cm.dispose();
                    return;
                }
                if (cm.getInventory(2).isFull(1)) {
                    cm.sendOk("请保证 #b消耗栏#k 至少有1个位置。");
                    cm.dispose();
                    return;
                }
                if (cm.getInventory(4).isFull(1)) {
                    cm.sendOk("请保证 #b其他栏#k 至少有1个位置。");
                    cm.dispose();
                    return;
                }
				cm.getPlayer().修改现金券(-10);
				cm.getPlayer().dropMessage("现金券-10");
                抽奖(1);
                break;
            case 1:
				if(现金券 < 95){
					cm.sendOk("你没有足够的现金券，无法抽奖。");
                    cm.dispose();
                    return;
				}
				
                if (cm.getInventory(1).isFull(9)) {
                    cm.sendOk("请保证 #b装备栏#k 至少有10个位置。");
                    cm.dispose();
                    return;
                }
                if (cm.getInventory(2).isFull(9)) {
                    cm.sendOk("请保证 #b消耗栏#k 至少有10个位置。");
                    cm.dispose();
                    return;
                }
                if (cm.getInventory(4).isFull(9)) {
                    cm.sendOk("请保证 #b其他栏#k 至少有10个位置。");
                    cm.dispose();
                    return;
                }
				cm.getPlayer().修改现金券(-95);
				cm.getPlayer().dropMessage("现金券-95");
                抽奖(10);
                break;
            default:
                cm.dispose();
                break;
        }
    }
}



function  抽奖(a) {
    var 抽奖结果 = "";
    for (var ii = 1; ii <= a; ii++) {
        var 随机概率 = Math.floor(Math.random() * 99);
		var 随机奖品 = Math.floor(Math.random() * (抽奖区域.length - 1));
		var 中奖记录 = 抽奖区域[随机奖品][4];
		var 记录条件 = 抽奖区域[随机奖品][5];
		if(抽奖区域[随机奖品][2]>1){
			var 随机数量 = Math.floor(Math.random() * 抽奖区域[随机奖品][2]) + 1;
		}else{
			var 随机数量 = 1;
		}
		var 获取概率 = 抽奖区域[随机奖品][1];
        var 奖品代码 = 抽奖区域[随机奖品][0];
		if(随机概率 <= 获取概率){
			cm.getPlayer().gainItem(奖品代码, 随机数量, false);
			抽奖结果 += "    #v" + 奖品代码 + "# #b#t" + 奖品代码 + "##k x " + 随机数量 + "\r\n";
			if(中奖记录 == 1 ){
				if(记录条件 > 0){
					if(随机数量  >= 记录条件){
						cm.中奖记录("    恭喜玩家 #b"+cm.玩家名字()+"#k 抽中 #r"+cm.getItemName(奖品代码)+"#k x "+随机数量+"");
					}
				}
			}
		}else{
			var 随机 = Math.floor(Math.random() * 100);
			if(随机 <= 10){
				var 随机数量 = Math.floor(Math.random() * 19)+1;
				cm.getPlayer().gainItem(2000004, 随机数量, false);
				抽奖结果 += "    #v2000004# #b#t2000004##k x " + 随机数量 + "\r\n";
			}else if(随机 > 10 && 随机 <= 20){
				var 随机数量 = Math.floor(Math.random() * 19)+1;
				cm.getPlayer().gainItem(2000005, 随机数量, false);
				抽奖结果 += "    #v2000005# #b#t2000005##k x " + 随机数量 + "\r\n";
			}else{
				var 随机数量 = Math.floor(Math.random() * 60000)+40000;
				cm.getPlayer().gainMeso(随机数量,false);
				抽奖结果 += "    #v4031039# 金币 x #b"+随机数量+"#k \r\n";
			}
		}
        
    }
    cm.sendOk("    恭喜你获得;\r\n" + 抽奖结果);
    cm.dispose();
}





















































