/********************************

ZEVMS 自由冒险岛Ver.027 
@小z QQ71447500

********************************/




var 收集物品数组 = [
	[4000000],//蓝色蜗牛壳
	[4000001],//花蘑菇盖
	[4000002],//蝴蝶结
	[4000003],//树枝
	[4000004],//绿液球
	[4000005],//叶子
	[4000006],//三眼章鱼触角
	[4000007],//火独眼兽之尾
	[4000008],//道符
	[4000009],//蓝蘑菇盖
	[4000010],//绿水灵珠
	[4000011],//蘑菇芽孢
	[4000012],//绿蘑菇盖
	[4000013],//风独眼兽之尾
	[4000014],//龙的头骨
	[4000015],//刺蘑菇盖
	[4000016],//红色蜗牛壳
	[4000018],//木块
	[4000019],//绿色蜗牛壳
	[4000020],//野猪尖牙
	[4000022],//石块
	[4000023],//冰独眼兽之尾
	[4000024],//火野猪尖牙
	[4000025],//黑石块
	[4000026],//猴子娃娃
	[4000029],//香蕉
	[4000031],//诅咒娃娃
	[4000035],//桌布
	[4000036],//奇妙的药
	[4000041],//巫婆的试验用青蛙
	[4000043],//红螃蟹钳
	[4000044],//青螃蟹钳
	[4000045],//乌龟壳
	[4000048],//小白雪人皮
	[4000049],//白雪人角
	[4000050],//企鹅王的嘴
	[4000051],//野狼之尾
	[4000052],//白狼之尾
	[4000053],//狼人脚趾甲
	[4000058],//食人花的种子
	[4000059],//星光精灵的星块
	[4000060],//月光精灵的月块
	[4000061],//日光精灵的日块
	[4000062],//黑食人花的种子
	//[4000067],//幼魔精灵的角
	[4000070],//红独角狮尾
	[4000071],//黄独角狮尾
	[4000072],//蓝独角狮尾
	[4000073]//独角狮硬角
]

function start() {
    status = -1;
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (status == 0 && mode == 0) {
        cm.dispose();
        return;
    }
    if (mode == 1) {
        status++;
    } else {
        status--;
    }
	
	var 等级 = cm.getLevel();
	var 完成环数 = cm.getPlayer().getbosslog("每日任务_跑环_收集物品完成");
	var 当前环数 = cm.getPlayer().getbosslog("每日任务_跑环_收集物品");
	var 收集物品 = cm.getPlayer().获取每日收集物品代码();
	var 最大环数 = 5;
	var 收集数量 = 等级;
	var 现金券 = cm.getPlayer().获取现金券();
	
    if (status == 0) {
		var 文本 = "  #i4030000#  #i4030001#  #i4030010# #r#e< 每日收集 >#k#n #i4030011#  #i4030014#  #i4030015#\r\n\r\n";

		if(完成环数<最大环数){
			文本 +="   开始任务后将会收集一些指定的随机物品，每次完成收集任务都会获取奖励，最终完成后将会获取丰厚的特殊奖励。\r\n";
			if(收集物品>0){
				文本 +="   #b每环奖励#k: "+((cm.装备出售价格(收集物品)*收集数量)+50000)+" 金币\r\n";
			}else{
				文本 +="   #b每环奖励#k: 金币\r\n";
			}
			文本 +="   #b最终奖励#k: 泡点金币收益 + 50 人气 + 1 能力点 + 1\r\n";
			文本 +="   #b当前环数#k: "+最大环数+" / "+当前环数+"\r\n";
			if(收集物品>0){
				文本 +="   #b收集物品#k: #v"+收集物品+"# #t"+收集物品+"# x "+收集数量+"\r\n";
			}
			if(收集物品==0){
				文本 +="\r\n";
				文本 +="  #L1##b开始第 "+(当前环数+1)+" 环收集#k#l\r\n";
			}else{
				文本 +="\r\n";
				文本 +="  #L2##b完成收集任务#k#l\r\n";
				文本 +="  #L4##b重置收集任务物品#k(#r现金券x5#k)#l\r\n";
				文本 +="  #L3##b直接完成收集任务#k(#r现金券x30#k)#l\r\n";
			}
		}else{
			文本 +="\r\n\r\n\t\t\t\t  已经完成今日收集。\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n.";
		}
		cm.sendSimple(文本);
    } else if (status == 1) {
		switch (selection) {
			case 4:
				if(现金券 >= 5){
					var 随机 = Math.floor(Math.random() * 收集物品数组.length);
					cm.getPlayer().设置每日收集物品代码(收集物品数组[随机]);
					cm.sendOk("开始收集任务，请收集 #v"+收集物品数组[随机]+"# #b#t"+收集物品数组[随机]+"# x "+收集数量+"");
					cm.getPlayer().修改现金券(-5);
					cm.getPlayer().dropMessage("现金券-5");
				}else{
					cm.sendOk("你没有足够的现金券。");
				}	
				cm.dispose();
                break;
			case 1:
				if(收集物品==0){
					var 随机 = Math.floor(Math.random() * 收集物品数组.length);
					cm.getPlayer().setbosslog("每日任务_跑环_收集物品");
					cm.getPlayer().设置每日收集物品代码(收集物品数组[随机]);
					cm.sendOk("开始收集任务，请收集 #v"+收集物品数组[随机]+"# #b#t"+收集物品数组[随机]+"# x "+收集数量+"");
				}
				cm.dispose();
                break;
			case 2:
			case 3:
				if(selection == 2){
					if (!cm.haveItem(收集物品,收集数量)) {
						cm.sendOk("需要 #v"+收集物品+"# #b#t"+收集物品+"##k x #b"+收集数量+"#k 才能完成任务。");
						cm.dispose();
						return;
					}
					cm.gainItem(收集物品,-收集数量);
				}
				if(selection == 3){
					if(现金券 < 30){
						cm.sendOk("你没有足够的现金券。");
						cm.dispose();
						return;
					}else{
						cm.getPlayer().修改现金券(-30);
						cm.getPlayer().dropMessage("现金券-30");
					}
				}
				cm.getPlayer().设置每日收集物品代码(0);
				if(当前环数 < 最大环数){
					var 金币 = ((cm.装备出售价格(收集物品)*收集数量)+50000);
					if(selection == 3){
						金币 += 100000;
					}
					
					cm.getPlayer().设置天梯积分(2);
					
					cm.sendOk("恭喜你完成该任务，获得 #b"+ 金币 +"#k 金币。");
					cm.gainMeso(金币);
				}else if(当前环数 == 最大环数){
					cm.getPlayer().getStat().gainAp(1);
					cm.getPlayer().gainFame(1);
					cm.getPlayer().set泡点金币((cm.getPlayer().get泡点金币()+(50)));
					cm.sendOk("恭喜你完成该任务，#b基础泡点金币收益 + 50  人气 + 1  能力点 + 1#k 。");
					
					cm.getPlayer().设置天梯积分(2);
				}
				cm.getPlayer().setbosslog("每日任务_跑环_收集物品完成");
				cm.dispose();
                break;
			default:
                cm.dispose();
                break;
		}
    }
}
